let yourAge = +prompt("Задача 1: Вкажіть Ваш вік", "");
if (yourAge >= 18 && yourAge <= 45) {
  alert("Ви нам підходите!");
} else {
  alert("Ви нам не підходите");
}
let zmA = +prompt("Задача 2: Вкажіть змінну a", "");
let zmB = +prompt("Задача 2: Вкажіть змінну b", "");
if (zmA > 3 && zmA < 12 && zmB >= 5 && zmB < 13) {
  alert("Вірно!!!");
} else {
  alert("НЕ ВІРНО!!!!");
} ///////////////////////////////////////////////////////////////////////
let Name = prompt("Задача 3: Введіть Ваше імя", "");
let sum = prompt("Задача 3: Введіть суму на депозит", "");
let period = prompt("Задача 3: Вкажіть на скільки місяців", "");
let koef;
if (period < 6) {
  koef = 0.15;
} else if (period > 9) {
  koef = 0.17;
} else koef = 0.16;
let dohid = +sum * koef;
alert(
  "Задача 3: Шановний " +
    Name +
    " ! Ви внесли " +
    sum +
    " грн. під " +
    +koef * 100 +
    " % річних на термін " +
    period +
    " місяців. За цей проміжок часу Ви заробите " +
    dohid +
    " грн."
);
